brew "automake"
brew "gettext"
brew "bash"
brew "black"
brew "btop"
brew "caddy"
brew "freetype"
brew "pcre2"
brew "cbonsai"
brew "cmake"
brew "curl"
brew "libtool"
brew "php"
brew "composer"
brew "fastfetch"
brew "fd"
brew "fzf"
brew "go"
brew "gomodifytags"
brew "goose"
brew "gopls"
brew "gotests"
brew "hugo"
brew "ios-deploy"
brew "isort"
brew "jsonpp"
brew "kotlin"
brew "lazygit"
brew "lua"
brew "luajit"
brew "luarocks"
brew "ninja"
brew "meson"
brew "mysql"
brew "node"
brew "nvm"
brew "pipenv"
brew "pipx"
brew "pkgconf"
brew "pytest"
brew "rbenv"
brew "ripgrep"
brew "sdl2"
brew "sdl3"
brew "starship"
brew "stow"
brew "tmux"
brew "tree"
brew "watchman"
brew "zig"
cask "bruno"
cask "dbeaver-community"
cask "ghostty"
cask "github"
cask "spotify"
cask "thunderbird"
cask "transmission"
cask "wezterm"
cargo "bob-nvim"
