#config
cask_args appdir: '/Applications'
#taps
tap 'homebrew/core'
tap "homebrew/bundle"
tap "homebrew/services"
tap 'caskroom/cask'
tap 'caskroom/versions'
tap 'heroku/brew'

#binaries
brew 'cmake'
brew 'curl'
brew 'docker'
brew 'git'
brew 'heroku-toolbelt'
brew 'hub'
brew 'nginx', restart_service: true 
brew 'node'
brew 'deno'
brew 'php', restart_service: true
brew 'python3'
brew 'tmux'
brew 'wget'

#zsh
brew 'zsh'
brew 'zsh-syntax-highlighting'

#databases
brew 'mysql@5.7'
brew 'postgresql'

#applications
cask 'alfred'
cask 'dropbox'
cask 'firefox'
cask 'google-drive'
cask 'intellij-idea'
cask 'iterm2'
cask 'java'
cask 'libreoffice'
cask 'private-internet-access'
cask 'slack'
cask 'spotify'
cask 'visual-studio-code'
cask 'vlc'
